[{"content": null}, {"content": "Monday, May 15:\r\n After a harrowing week of cyclone predictions, Mocha finally made landfall over Myanmar and Bangladesh yesterday afternoon, narrowly missing India in the process. The storm struck t… [+2819 chars]"}, {"content": null}, {"content": "Royal Challengers Bangalore put in arguably their finest performance of the season, bundling out Rajasthan Royals for just 59 runs while defending their total of 171 in an Indian Premier League (IPL)… [+2199 chars]"}, {"content": "The team of NCB officers led by IRS officer Sameer Wankhede, which conducted the raid on the Cordelia cruise and now faces a CBI FIR, had dropped the name of nearly 17 persons as suspects who were al… [+4084 chars]"}, {"content": null}, {"content": "The trailer of Vicky Kaushal and Sara Ali Khan's upcoming film Zara Hatke Zara Bachke is out and is equal parts romantic and dramatic. This is their first film together and is directed by Laxman Utek… [+2351 chars]"}, {"content": "Do You Feel Angry And Restless In Summers? 4 Steps To Not Let The Heat Get To You\r\nExtreme summer heat can take a toll on our mood making us feel angry, restless and unproductive. Here are some steps… [+3181 chars]"}, {"content": "IMAGE: Suryakumar Yadav is fourth highest run-getter in IPL 2023, with 479 runs in 12 matches, including four fifties and a century, at an amazing strike of 190. Photograph: BCCI\r\nMumbai Indians are … [+3199 chars]"}, {"content": "Reported By:| Edited By: DNA Web Team |Source: DNA Web Desk |Updated: May 15, 2023, 01:48 PM ISTOppo F23 5G is here. Oppo has launched the new Oppo F23 5G smartphone in India today (May 15) at a star… [+1284 chars]"}, {"content": null}, {"content": "Chennai Super Kings faced a hiccup in the race for playoffs on Sunday night, as they faced a six-wicket loss to Kolkata Knight Riders in Chennai. After being restricted to 144/6 in 20 overs, the CSK … [+1663 chars]"}, {"content": "In a rejoinder affidavit filed by the the Securities and Exchange Board of India (SEBI) today in the Supreme Court, the apex regulatory body has given additional reasons for seeking more time to prob… [+6425 chars]"}, {"content": "If you are a climate change warrior or know someone who is doing incredible work in this space, send us your entries and we'll bring the most innovative stories to the world."}, {"content": "On a daily basis, NASA leaves us mesmerized with mind-blowing pictures of outer space that its massive telescopes on the ground and up in the sky keep taking. And today is no exception, with the awe-… [+2214 chars]"}, {"content": "A male passenger was arrested for allegedly molesting an air hostess on board a Dubai-Amritsar flight in an inebriated state, police said on Monday.\r\nThe accused, identified as Virendra Singh Thakur … [+883 chars]"}, {"content": null}, {"content": "HBSE 12th Result 2023 Live: Haryana board Class 12 result has been declared. Haryana Board of School Education (BSEH) announced HBSE Class 12th board exam results at a press conference. The direct li… [+6630 chars]"}, {"content": "San Francisco: Apple's lower-end iPhone 15 and iPhone 15 Plus models launching later this year will reportedly feature a 48-megapixel rear camera lens.\r\nAccording to Haitong International Securities … [+1028 chars]"}, {"content": "Foxconn has thanked Telangana government for a favourable business environment\r\nHyderabad: Apple supplier Foxconn will invest $500 million in Telangana and as many as 25,000 jobs will be created in t… [+2599 chars]"}]